Tekla.Structures.Filtering.Categories.PartFilterExpressions.Profile
The Profile class represents the profile filter expression.

Tekla.Structures.Filtering.Categories.PartFilterExpressions.Profile.#ctor
Initializes a new instance of the Profile class.